Revit 2026 API

# EnergyDataSettingsIsExportMullionsEnabled Property

---

Indicates if mullions are included in GreenBuildingXML export of the detailed model.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsExportMullionsEnabled { get; }
```
```vb
Public ReadOnly Property IsExportMullionsEnabled As Boolean
	Get
```
```cpp
public:
property bool IsExportMullionsEnabled {
	bool get ();
}
```
```fsharp
member IsExportMullionsEnabled : bool with get
```

#### Property Value

Boolean

Result is based on the ExportComplexity setting. When this setting is on, mullions will be exported as shading surfaces. A "simplified" analytical shading surface is produced from a mullion based on its centerline, thickness, and offset.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace